{
  "d": {
    "Id": "ICAPrepackagedContent",
    "Name": "EDI Integration Templates for SAP Integration Advisor",
    "Description": "\u003cp\u003e\u003c/p\u003e \n\u003cp\u003e\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003eThis package provides the required template of inbound and outbound integration flows for the processing of UN/EDIFACT (and UN/EDIFACT subsets-like GS1 EANCOM or Odette EDIFACT), ODETTE, ASC X12 or cXML interchange to SAP IDoc, SAP SOAP or vice versa. These templates only have the necessary steps for processing the B2B data appropriately. Please note that most of these steps are empty and have to be filled with the corresponding runtime artefacts provided by SAP Integration Advisor (IA). Furthermore, it is necessary to define and customize the communication adapters as well as the required information of the interchange envelope and as well as header structures. Following templates of integration flows are available:\u003c/p\u003e \n\u003cp\u003eFor inbound direction:\u003c/p\u003e \n\u003cul\u003e \n \u003cli\u003e\u003cstrong\u003eEDI to SAP IDoc - Inbound\u003c/strong\u003e - Integration flow template for building inbound EDI (ASC X12, UN/EDIFACT, UN/EDIFACT subsets-like GS1 EANCOM or Odette EDIFACT, ODETTE) to SAP IDoc integration scenarios using SAP IA.\u003c/li\u003e \n \u003cli\u003e\u003cstrong\u003eEDI to SAP SOAP - Inbound\u003c/strong\u003e - Integration flow template for building inbound EDI (ASC X12, UN/EDIFACT, UN/EDIFACT subsets-like GS1 EANCOM or Odette EDIFACT, ODETTE to SAP SOAP integration scenarios using SAP IA.\u003c/li\u003e \n \u003cli\u003e\u003cstrong\u003ecXML to SAP\u0026nbsp;IDoc - Inbound\u003c/strong\u003e - Integration flow template for building inbound cXML to SAP IDoc integration scenarios using SAP IA.\u003c/li\u003e \n\u003c/ul\u003e \n\u003cp\u003eFor outbound direction:\u003c/p\u003e \n\u003cul\u003e \n \u003cli\u003e\u003cstrong\u003eSAP IDoc to EDIFACT - Outbound\u003c/strong\u003e - Integration flow template for building outbound SAP IDoc to EDIFACT (including UN/EDIFACT subsets-like GS1 EANCOM or Odette EDIFACT, ODETTE) integration scenarios using SAP IA.\u003c/li\u003e \n \u003cli\u003e\u003cstrong\u003eSAP IDoc to X12 - Outbound\u003c/strong\u003e - Integration flow template for building outbound SAP IDoc to ASC X12 integration scenarios using SAP IA.\u003c/li\u003e \n \u003cli\u003e\u003cstrong\u003eSAP IDoc to cXML - Outbound\u003c/strong\u003e - Integration flow template for building outbound SAP IDoc to cXML integration scenarios using SAP IA.\u003c/li\u003e \n \u003cli\u003e\u003cstrong\u003eSAP SOAP to\u0026nbsp; EDIFACT - Outbound\u003c/strong\u003e - Integration flow template for building outbound SAP SOAP to\u0026nbsp; EDIFACT (including UN/EDIFACT subsets-like GS1 EANCOM or Odette EDIFACT, ODETTE) integration scenarios using SAP IA.\u003c/li\u003e \n \u003cli\u003e\u003cstrong\u003eSAP SOAP to\u0026nbsp; X12 - Outbound\u003c/strong\u003e - Integration flow template for building outbound SAP SOAP to ASC X12 integration scenarios using SAP IA.\u003c/li\u003e \n\u003c/ul\u003e \n\u003cp\u003eHow to use these templates of integration flows is described in detail in the attached documents, which you will find in the tab \"Documents\".\u003c/p\u003e \n\u003cp\u003e\u0026nbsp;\u003c/p\u003e \n\u003cp\u003e\u003c/p\u003e \n\u003cp\u003e\u003c/p\u003e",
    "ShortText": "Integration flow templates for SAP Integration Advisor (IA) related EDI integration scenarios.",
    "Version": "1.0.5",
    "Vendor": "SAP",
    "Mode": "EDIT_ALLOWED",
    "Products": "ThirdParty,Third Party,SAPAriba,SAP ERP,SAPCloudPlatformIntegrationAdvisor,SAPS4HANA,SAPERP",
    "Keywords": "integration template,SAP integration Advisor"
  }
}