{
  "d": {
    "Id": "PIPipelineGenericIntegrationFlows.7.4.2025.14.29.25",
    "Name": "Process Integration Pipeline - Generic Integration Flows and Templates.7.4.2025.14.29.25",
    "Description": "\u003cp\u003eThis integration package contains the generic integration flows as well as a set of templates for the scenario-specific integration flows required to setup a Process Integration (PI) pipeline on Cloud Integration for asynchronous and synchronous message processing. The pipeline for Cloud Integration can be seen as a sort of framework providing exactly once delivery, error handling and restart capabilities out of the box.\u003c/p\u003e\n\u003cp\u003eThe following features are supported:\u003c/p\u003e\n\u003cul\u003e\n \u003cli\u003eSupport for most commonly used Enterprise Integration Patterns such as Point-to-Point, Content-Based-Router, Recipient List, etc.\u003c/li\u003e\n \u003cli\u003eAsynchronous pipeline for asynchronous message processing with decoupling of pipeline steps via limited number of JMS queues\u003c/li\u003e\n \u003cli\u003eSynchronous pipeline for synchronous Content-Based-Router scenarios\u003c/li\u003e\n \u003cli\u003eGeneric inbound flows for XI inbound and IDoc inbound scenarios\u003c/li\u003e\n \u003cli\u003eFlexible scenario configuration via Partner Directory\u003c/li\u003e\n \u003cli\u003eRetry and error handling capabilities incl. dead letter queue handling\u003c/li\u003e\n \u003cli\u003eImproved monitoring by supporting SAP headers and custom header properties\u003c/li\u003e\n \u003cli\u003eExtension for custom error handling\u003c/li\u003e\n \u003cli\u003eExtension for custom receiver and interface determination\u003c/li\u003e\n \u003cli\u003eOption to reuse extended receiver determination mappings from SAP Process Orchestration\u003c/li\u003e\n \u003cli\u003eSupport for test mode\u003c/li\u003e\n \u003cli\u003eSupporting different tenant stages, e.g., DEV, QA, PRD\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMore details on the PI pipeline concept can be found on the\u0026nbsp;\u003ca href=\"https://help.sap.com/docs/help/90c8ad90cb684ee5979856093efe7462/c344b1c395144095834a961699293889.html\" rel=\"nofollow\"\u003eMigration Guide for SAP Process Orchestration\u003c/a\u003e.\u003c/p\u003e",
    "ShortText": "This integration package contains the generic integration flows required to setup a Process Integration pipeline on Cloud Integration including templates for setting up the scenario-specific integration flows.",
    "Version": "1.0.10",
    "Vendor": "SAP",
    "Mode": "EDIT_ALLOWED",
    "Keywords": "Best Practices,Guidelines"
  }
}