{
  "d": {
    "Id": "SAPLeanIXIntegrationwithSAPIntegrationSuite",
    "Name": "SAP LeanIX Integration with SAP Integration Suite",
    "Description": "\u003cp\u003e\u003cp style=\"margin: 0cm ; line-height: 110% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif\"\u003eThis integration package is designed to synchronize data between SAP LeanIX and Integration Assessment, focusing primarily on the synchronization of Applications, Vendors and Interface Requests. Utilizing the SAP Integration Suite, this synchronization process ensures a seamless, secure, and up-to-date data flow. This enhances the accuracy and efficiency of IT integration strategies, providing comprehensive insights for integration assessments.\u003c/p\u003e\n\u003cp style=\"margin: 0cm ; line-height: 110% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif\"\u003e\u0026nbsp;\u003c/p\u003e\n\u003cp style=\"margin: 0cm ; line-height: 110% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif\"\u003e\u003cstrong\u003eNote\u003c/strong\u003e: Due to the equivalence of 'Vendors' in Integration Assessment to 'Providers' in SAP LeanIX for simplicity and clarity, 'vendor' is used as the uniform term throughout the package.\u003c/p\u003e\n\u003cp style=\"margin: 0cm ; line-height: 110% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif\"\u003e\u0026nbsp;\u003c/p\u003e\n\u003cp style=\"margin: 0cm ; line-height: 110% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif\"\u003eThe package comprises four distinct integrations, each serving unique functions and designed to operate independently. Users can select and deploy any iFlow according to their specific requirements and needs:\u003c/p\u003e\n\u003cp style=\"margin: 0cm ; line-height: 110% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif\"\u003e\u0026nbsp;\u003c/p\u003e\n\u003col style=\"margin-top: 0cm ; margin-bottom: 8pt\"\u003e\n\u003cli style=\"margin: 0cm 0cm 8pt 0.4px ; line-height: 107% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif ; color: #070f26 ; text-indent: 0.4px\"\u003e\u003cstrong\u003eFullsync Integration Assessment Vendors\u003c/strong\u003e: Synchronizes all vendors (providers) from SAP LeanIX to Integration Assessment. This interface is triggered manually and operates once per trigger.\u003c/li\u003e\n\u003cli style=\"margin: 0cm 0cm 8pt 0.4px ; line-height: 107% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif ; color: #070f26 ; text-indent: 0.4px\"\u003e\u003cstrong\u003eFullsync Integration Assessment Applications\u003c/strong\u003e: Synchronizes all applications from SAP LeanIX to Integration Assessment. This includes optional synchronization of application instances (on-premise/public-cloud/private-cloud). This interface is also manually triggered and operates once per trigger.\u003c/li\u003e\n\u003cli style=\"margin: 0cm 0cm 8pt 0.4px ; line-height: 107% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif ; color: #070f26 ; text-indent: 0.4px\"\u003e\u003cstrong\u003eCreate Integration Assessment Vendor\u003c/strong\u003e: Activated whenever a factsheet of type 'provider' is created in SAP LeanIX. This event triggers the creation of a new vendor in Integration Assessment, ensuring real-time data updates.\u003c/li\u003e\n\u003cli style=\"margin: 0cm 0cm 8pt 0.4px ; line-height: 107% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif ; color: #070f26 ; text-indent: 0.4px\"\u003e\u003cstrong\u003eCreate Integration Assessment Application\u003c/strong\u003e: Similar to the vendor creation interface, this is activated when a factsheet of type 'application' is created in SAP LeanIX. It triggers the creation of a new application in Integration Assessment, including the synchronization of application instances (on-premise/public-cloud/private-cloud) if applicable. This interface also requires manual triggering and operates once per trigger.\u003c/li\u003e\n\u003cli style=\"margin: 0cm 0cm 8pt 0.4px ; line-height: 107% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif ; color: rgb( 7 , 15 , 38 ) ; text-indent: 0.4px\"\u003e\u003cstrong\u003eCreate SAP LeanIX Interface Factsheet\u003c/strong\u003e: Synchroniz a SAP LeanIX Interface Fact Sheet from Integration Assessment Interface Requests at a configurable interval. Applications selected in the Interface Request will also be referenced in the Fact Sheet, provided they have been synced by this package.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp style=\"margin: 0cm ; line-height: 110% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif\"\u003e\u003cstrong\u003e\u003cbr\u003ePlease refer to the documentation for the exact details regarding the configuration.\u003c/strong\u003e\u003c/p\u003e\u003c/p\u003e",
    "ShortText": "Integrate SAP LeanIX with the SAP Integration Suite's Integration Assessment capability to efficiently replicate Applications, Instances, Providers and Interfaces Requests between SAP LeanIX and Integration Assessment.",
    "Version": "1.1.0",
    "Vendor": "NTTData Bussiness Solutions GmbH",
    "Mode": "EDIT_ALLOWED",
    "Products": "LeanIX,SAPCloudPlatformIntegrationSuite",
    "Keywords": "SAP Integration Assessment,SAP LeanIX Factsheets,SAP LeanIX Eventing"
  }
}