{
  "d": {
    "Id": "IntegrationFlowDesignGuidelinesPartnerDirectoryGuidelines",
    "Name": "Integration Flow Design Guidelines - Use the Partner Directory Appropriately",
    "Description": "\u003cp\u003eThe Partner Directory is used in integration scenarios where you establish a communication network between\u0026nbsp;\u003cem\u003emany\u003c/em\u003e\u0026nbsp;communication partners. In such kind of scenarios, you build one or a few integration flows which are parametrized by partner-specific information. The parametrized components in the integration flow read the partner-specific information from the Partner Directory. The Partner Directory contains for each partner parameters, like\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ethe\u0026nbsp;\u003cem\u003eAuthorized User\u003c/em\u003e\u0026nbsp;which is authorized to call inbound endpoints of the integration flow(s),\u003c/li\u003e\n\u003cli\u003ethe HTTP addresses needed for making outbound calls to the partner systems.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWith the Partner Directory, it is possible to add new communication partners without downtime and without changing or redeploying the integration flows. The\u0026nbsp;tenant administrator\u0026nbsp;or Partner Directory configurator can enter entries of a new partner into the Partner Directory via an OData API while the message processing for the existing partners is ongoing.\u003c/p\u003e\n\u003cp\u003eCheck out the \u003ca href=\"https://help.sap.com/viewer/368c481cd6954bdfa5d0435479fd4eaf/Cloud/en-US/0fe80dc9d3be4dfbbb89ee4c791d326e.html\" rel=\"nofollow\"\u003eSAP Help Portal\u003c/a\u003e for a description of the Partner Directory capabilities.\u003c/p\u003e\n\u003cp\u003eGet a detailed description of the Partner Directory API on \u003ca href=\"https://api.sap.com/api/PartnerDirectory/resource\" rel=\"nofollow\"\u003eSAP API Business Hub\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eIn the Documents section you will find some useful Postman Collections.\u003c/p\u003e\n\u003cp\u003eAdvantages of using these collections and the environment structure are as follows:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSwitch easily between tenants, you can use the same environment for both postman collections.\u003c/li\u003e\n\u003cli\u003eA standardized and easy way to use CSRF token for the APIs that use\u0026nbsp;\u003ccode\u003ePOST\u003c/code\u003e,\u0026nbsp;\u003ccode\u003ePUT\u003c/code\u003e,\u0026nbsp;\u003ccode\u003eDELETE\u003c/code\u003e\u0026nbsp;methods.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eGetting Started\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDownload the postman collections and the postman environment files\u003c/li\u003e\n\u003cli\u003eImport the postman collections (import button on the top-left corner) and the postman environment (environment settings on the top-right corner)\u003c/li\u003e\n\u003cli\u003eDuplicate the environment template for each SAP Cloud Integration tenant you use (and rename collections accordingly) and enter the specific tenant details\u003c/li\u003e\n\u003cli\u003eChoose the environment you defined earlier and start using collections\u003c/li\u003e\n\u003cli\u003eBefore you do any operation you need to fetch a \u003ccode\u003eCSRF\u003c/code\u003e\u0026nbsp;token. Call\u0026nbsp;\u003ccode\u003eGet CSRF\u003c/code\u003e\u0026nbsp;request once before using e.g.\u0026nbsp;\u003ccode\u003ePOST\u003c/code\u003e\u0026nbsp;methods in the collections\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis\u0026nbsp;\u003ca href=\"https://help.sap.com/viewer/368c481cd6954bdfa5d0435479fd4eaf/Cloud/en-US/03e69592b8f04bf5aa350966802f994b.html\" rel=\"nofollow\"\u003edocumentation\u003c/a\u003e\u0026nbsp;explains how to work with the Postman collection attached to this integration package in general.\u003c/p\u003e\n\u003cp\u003eMore details on the guidelines covered in this integration package can be found on\u0026nbsp;\u003ca href=\"https://help.sap.com/viewer/368c481cd6954bdfa5d0435479fd4eaf/Cloud/en-US/6e00412aebd549f8b5771c9397c08c5d.html\" rel=\"nofollow\"\u003eSAP Help Portal\u003c/a\u003e.\u003c/p\u003e",
    "ShortText": "This integration package contains integration flows to illustrate the design guidelines for Partner Directory. More details can be found on SAP Help Portal.",
    "Version": "1.0.2",
    "Vendor": "SAP",
    "Mode": "EDIT_ALLOWED",
    "Keywords": "Guidelines,Partner Directory,Examples,Best Practices"
  }
}