{
  "d": {
    "Id": "LeanIXIntegrationAssessment",
    "Name": "LeanIX Integration with SAP Integration Assessment",
    "Description": "\u003cp\u003e\u003cp style=\"margin: 0cm ; line-height: 110% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif\"\u003eThis integration package is designed to synchronize data between LeanIX and SAP Integration Assessment, focusing primarily on application and vendor (referred to as 'providers' in LeanIX) information. Utilizing the powerful capabilities of the SAP Integration Suite, this synchronization process ensures a seamless, secure, and up-to-date data flow. This enhances the accuracy and efficiency of IT integration strategies, providing comprehensive insights for integration assessments.\u003c/p\u003e\n\u003cp style=\"margin: 0cm ; line-height: 110% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif\"\u003e\u0026nbsp;\u003c/p\u003e\n\u003cp style=\"margin: 0cm ; line-height: 110% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif\"\u003e\u003cstrong\u003eNote\u003c/strong\u003e: \"Vendors\" in Integration Assessment are equivalent to \"Providers\" in LeanIX for simplicity and clarity.\u003c/p\u003e\n\u003cp style=\"margin: 0cm ; line-height: 110% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif\"\u003e\u0026nbsp;\u003c/p\u003e\n\u003cp style=\"margin: 0cm ; line-height: 110% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif\"\u003eThe package comprises four distinct integrations, each serving unique functions and designed to operate independently. Users can select and deploy any iFlow according to their specific requirements and needs:\u003c/p\u003e\n\u003cp style=\"margin: 0cm ; line-height: 110% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif\"\u003e\u0026nbsp;\u003c/p\u003e\n\u003col style=\"margin-top: 0cm ; margin-bottom: 8.0pt\"\u003e\n\u003cli style=\"margin: 0cm 0cm 8pt 0.4px ; line-height: 107% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif ; color: #070f26 ; text-indent: 0.4px\"\u003e\u003cstrong\u003eFullsync Integration Assessment Vendors\u003c/strong\u003e: Synchronizes all vendors (providers) from LeanIX to SAP Integration Assessment. This interface is triggered manually and operates once per trigger.\u003c/li\u003e\n\u003cli style=\"margin: 0cm 0cm 8pt 0.4px ; line-height: 107% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif ; color: #070f26 ; text-indent: 0.4px\"\u003e\u003cstrong\u003eFullsync Integration Assessment Applications\u003c/strong\u003e: Synchronizes all applications from LeanIX to SAP Integration Assessment. This includes optional synchronization of application instances (on-premise/public-cloud/private-cloud). This interface is also manually triggered and operates once per trigger.\u003c/li\u003e\n\u003cli style=\"margin: 0cm 0cm 8pt 0.4px ; line-height: 107% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif ; color: #070f26 ; text-indent: 0.4px\"\u003e\u003cstrong\u003eCreate Integration Assessment Vendor\u003c/strong\u003e: Activated whenever a factsheet of type 'provider' is created in LeanIX. This event triggers the creation of a new vendor in SAP Integration Assessment, ensuring real-time data updates.\u003c/li\u003e\n\u003cli style=\"margin: 0cm 0cm 8pt 0.4px ; line-height: 107% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif ; color: #070f26 ; text-indent: 0.4px\"\u003e\u003cstrong\u003eCreate Integration Assessment Application\u003c/strong\u003e: Similar to the vendor creation interface, this is activated when a factsheet of type 'application' is created in LeanIX. It triggers the creation of a new application in SAP Integration Assessment, including the synchronization of application instances (on-premise/public-cloud/private-cloud) if applicable. This interface also requires manual triggering and operates once per trigger.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp style=\"margin: 0cm ; line-height: 110% ; font-size: 10pt ; font-family: \u0026#34;arial\u0026#34; , sans-serif\"\u003eEach integration is designed to ensure that your IT integration strategies are supported by the most current and relevant data, fostering informed decision-making and efficient management of IT resources.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003c/p\u003e",
    "ShortText": "Integrating LeanIX with Integration Assessment to replicate Applications, Instances, and Providers - from LeanIX to Integration Assessment. This can be done through full sync or by creating entities triggered by LeanIX events.",
    "Version": "1.0.0",
    "Mode": "EDIT_ALLOWED",
    "Products": "LeanIX,SAPCloudPlatformIntegrationSuite",
    "Keywords": "SAP Integration Asessment,FactSheet,LeanIX Eventing",
    "LineOfBusiness": "Technology Area Enterprise Technology"
  }
}